[
  {
    "path": "posts/2021-03-09-dataviz-makeover-3/",
    "title": "ISSS608 Visual Analytics - DataViz Makeover 3",
    "description": "Analysis of Data Visualisation on South-east Asia Armed Conflict.",
    "author": [
      {
        "name": "Louis Chong Jia Jun (louis.chong.2019@mitb.smu.edu.sg)",
        "url": "https://www.linkedin.com/in/louis-chong-jia-jun"
      }
    ],
    "date": "2021-03-09",
    "categories": [],
    "contents": "\r\n1.0 Critiques and Improvements of Data Visualisation\r\nThe South-east Asia Armed Conflict Analysis is a data visualisation created to reveal the spatio-temporal patterns of armed conflict in selected South-east Asia countries between 2015-2020 (see Figure 1). The dataset is collected by trained data experts worldwide and can be downloaded at The Armed Conflict Location & Event Data Project (ACLED). The dataset contains the location, date, type, actor(s) and number of fatalities of a political violence, demonstration or select non-violent, politically important event from 2010 to 2020, as well as the source that reported the event and additional note. Full details of the dataset can be found in the Codebook.\r\nFigure 1: Original Data VisualisationClarity\r\n[C.1] The data visualisation is titled “Armed Conflict Location & Event in Myanmar, 2015-2020” and “Armed Conflict Event by Type”. However, this does not accurately represent the dataset, as there are more event types beyond just armed conflicts e.g. demonstrations, select non-violent, politically important events.\r\n[C.2] Each location (or dot/symbol) is coloured according to the event type. However, the number of events and fatalities at each location are not shown. As such, readers are not able to compare and understand the extent and severity of events at each location.\r\n[C.3] While readers can compare the number of events by event type in each year with the graphs, they are unable to compare the number of fatalities by event type in each year, number of events by actor type in each year and number of fatalities by actor type in each year. As such, they are not able to fully understand the breakdown of events and fatalities by event and actor type.\r\n[C.4] There is no lead-in paragraph in the data visualisation. As such, readers cannot pick out the overall summary and key figures of the data visualisation. For example, the total number of events and fatalities can be indicated for the chosen event type, location, date and actor type e.g. “10 Events and 50 Fatalities for Battles, Riots in Myanmar in 2017-2020 by State Forces”.\r\n[C.5] The map in the data visualisation cannot be used by readers to easily total up and compare the number of events and fatalities across countries. As such, they are unable to compare the extent and severity of events across countries.\r\n[C.6] The data source is not cited in the data visualisation. This is not ideal, as readers will not be able to find out more about the background and details of the data source.\r\nAesthetics\r\n[A.1] The axes of graphs used to illustrate the number of events by event type in each year are not synchronised. This may give readers a wrong visual perception when they compare the number of events for each event type. For example, a quick glance may cause readers to think that the number of riots is more than battles in Myanmar in 2020.\r\n[A.2] It is redundant and not aesthetically pleasing to have “Count of Sheet1” in the row labels and tooltip of the graphs, as readers may be confused by its meaning.\r\n[A.3] The map has overlapping dots/symbols, which do not have borders. Furthermore, there may be multiple event types occurring at a location. This makes it hard for readers to differentiate each point and find out the different types of events that occur at a location.\r\n[A.4] The lines of the graphs are not coloured by event type, so it’s harder for readers to do a visual comparison between the line graphs and the map.\r\n[A.5] There is an attempt to sort the graphs by number of events. However, it’s unclear whether it’s sorted by number of events in 2020 or total number of events in 2015-2020.\r\n[A.6] The Event Id Cnty, Latitude and Longitude are shown in the tooltip of the map. These may not be meaningful information for readers.\r\nInteractivity\r\n[I.1] Readers can only filter based on the country and cannot filter by event type, date, actor type. This limits the analysis that readers can carry out when using the dashboard.\r\n[I.2] Readers are unable to use the dashboard to find out further details of each location e.g. number of events or fatalities by event or actor type. As such, readers are not able to compare and understand the extent and severity of events at each location.\r\n[I.3] The data visualisation is not animated, so readers are unable to understand the change in event type, number of events and fatalities as different filters are applied.\r\nSketch of Proposed Design\r\nFigure 2 shows the sketch of the proposed data visualisation to replace the original. It will address the critiques which were mentioned earlier.\r\nFigure 2: Sketch of Proposed Design[C.1, C.4] Parameters are created to allow readers to choose to show the Number of Events or Fatalities and Event or Actor Type. The titles and lead-in paragraph will change according to what the readers choose under the filters (Event Date, Country, Event Type, Actor Type) and parameters. This will accurately reflect the dataset used for the data visualisation and give readers a summary of the key figures.\r\n[C.2, I.2] The number of events or fatalities, depending what parameters readers choose, will determine the colour shade and size of dots/symbols of the maps. This allows readers to have a quick comparison of the extent and severity of events at different locations. Readers can also look at the number of events or fatalities by event or actor type in each location under Tooltip.\r\n[C.3] Readers can choose whether to show the number of events or fatalities and the event or actor type in the data visualisation (maps and line graph). This allows readers to understand deeper the breakdown of events and fatalities by event and actor type.\r\n[C.5] An additional Choropleth Map is proposed to allow comparison of number of events or fatalities across countries by colour shade. Only 8 Southeast Asia countries are to be shown in the map, hence an unclassified Choropleth Map is proposed to allow readers to compare between any two countries. Readers can also look at the number of events, number of fatalities and event types in each country under Tooltip.\r\n[C.6] The data source will be labelled at the bottom of the data visualisation or dashboard.\r\n[A.1] Instead of having different graphs and unsynchronised axes for each event type, a single graph with one common axis is proposed. This allows accurate comparison of the number of events or fatalities by event or actor type.\r\n[A.2] The row label “Count of Sheet1” is omitted from the graph to avoid confusion. Instead of naming as “Count of Sheet1” in the tooltip, it will be named as Number and the line graph is labelled according to what it represents e.g. number of events by event type to give clarity to readers on what the graph represents.\r\n[A.3] The dots in the Proportional Symbol Map will be coloured according to the event or actor type. A border of a similar and slightly darker colour tone and different opacity are set to allow readers to easily differentiate each point, click and find out more details of each location. Where there are multiple event or actor types at a certain location, readers can either filter according to event or actor type, or click on the relevant event or actor type on the legend.\r\n[A.4] Each line in line graph is coloured according to the event or actor type, similar to the map, to allow easy visual comparison.\r\n[A.5] Sorting is not necessary, as a single graph with one common axis is proposed instead.\r\n[A.6] The Event Id Cnty, Latitude and Longitude can be omitted from the tooltip. More meaningful information such as country, province, location, number of events of fatalities by event or actor type can be made available to the readers instead.\r\n[I.1] The data visualisation can be filtered by Event Date, Country, Event Type and Actor Type. Country is used as the location filter, instead of province or county, as the data visualisation focuses on comparison among countries and there may be zero or few events or fatalities in some provinces or counties. A choice can also be made whether to show the Number of Events or Fatalities and the Event or Actor Type in the data visualisation. This allows readers to carry out deeper analysis and comparison.\r\n[I.3] Animation is switched on to allow readers to understand the change in event type, number of events and fatalities as different filters are applied.\r\nNote: Precision is not regarded as a major concern for this data visualisation, hence time and geo precision codes are not taken into account. In addition, other information such as secondary actor(s), associated actor(s), interaction of actor(s) and source that reported event are not considered as the focus of this data visualisation and are omitted.\r\n2.0 Step-by-Step Description of Data Visualisation Preparation\r\nImport into Tableau and Data Preparation\r\nThe Southeast Asia dataset is downloaded from ACLED and imported into Tableau (Figure 3).\r\nFigure 3: Import into Tableau TypeThe data types of the following columns are changed - Inter1 (String), Region (Geographical Role: Country/Region), Admin1 (Geographical Role: State/Province), Location (Geographical Role: County) (Figure 4). As some events have the same Admin1, Admin2 and Admin3, we will only focus on using Country, Admin1 and Location to create and label the maps. Admin2 and Admin3 will not be used.\r\nFigure 4: Changing Data TypeNext, we edit the Aliases of Inter1 by following the steps in Figure 5.\r\nFigure 5: Edit AliasesColumns that are not used in this data visualisation are hidden (Figure 6). The\r\nFigure 6: Hiding Data ColumnsThe following columns are renamed (Figure 7) - Event Id Cnty (Event ID), Actor1 (Actor), Inter1 (Actor Type), Admin1 (Province).\r\nFigure 7: Renaming Data ColumnsThe final data table to be used for the data visualisation is seen in Figure 8.\r\n * Moving on to the Worksheet, Actor Type is shifted to Dimensions (Figure 9).\r\nFigure 9: Shift to DimensionsTwo parameters (Number, Type) are created to allow readers to choose whether to show the number of events or fatalities and event or actor type in the data visualisation (Figure 10).\r\nFigure 10: Create ParametersThe following calculated fields are created to count the number of events and to extract the relevant data based on the parameter chosen by readers and display them in the data visualisation (Figure 11).\r\nNumber of Events: 1\r\nNumber: IF [Parameters].[Number]=“Events” THEN [Number of Events] ELSE [Fatalities] END\r\nType: IF [Parameters].[Type]=“Event” THEN [Event Type] ELSE [Actor Type] END\r\n\r\nFigure 11: Create Calculated FieldsLine Graph\r\nFirst, the line graph displaying the number of events or fatalities by event type, number of events or fatalities by actor type in each year is created on a new worksheet.\r\nEvent Date is placed under Columns and it’s kept as Year(Event Date). Number is placed under Rows as it’s kept as Sum. Type is placed under Color (Figure 12).\r\nFigure 12: Line Graph Part 1Next, we will click on Show Parameter and readers will be able to choose to display the Number of Events or Fatalities by Event or Actor Type (Figure 13).\r\nFigure 13: Line Graph Part 2It is noted that Actor Type will appear in numerical format. Thus, we edit the Aliases of Actor Type by first choosing Actor as Type under Parameter, then edit the Aliases, as seen in Figure 14.\r\nFigure 14: Line Graph Part 3The field label for Event Date is hidden, given that it’s intuitive. In addition, the axis for Number is edited to remove the title (Figure 15).\r\nFigure 15: Line Graph Part 4The title and tooltip of the line graph are edited, as seen in Figure 16. This will reflect the parameter chosen by readers.\r\nFigure 16: Line Graph Part 5The view is changed to Entire View (Figure 17) and the final interactive line graph is seen in Figure 18.\r\nFigure 17: Line Graph Part 6Figure 18: Final Line GraphChoropleth Map\r\nNext, the Choropleth Map is created on a new worksheet, which displays the number of events or fatalities in each country, coloured by the number of events or fatalities.\r\nNumber and Country are placed under Columns and Rows respectively. Then, we clicked Show Me and choose the area map. As a result, we should see the following variables in the respective locations - Longitude (generated) (Columns), Latitude (generated) (Rows), Country (Detail), Number (Color) (Figure 19).\r\nFigure 19: Choropleth Map Part 1To allow readers to have an interactive view of the number of events or fatalities by event or actor type in each country under tooltip, a new worksheet (By Type) is created. Type is placed under Rows and Number under Text. The field label for Type is hidden, as it will be labelled under tooltip instead. These steps and the breakdown of number of events or fatalities are seen in Figure 20.\r\nFigure 20: Breakdown of Number of Events or Fatalities by Event or Actor TypeNext, we return to the Choropleth Map to edit the tooltip. The worksheet “By Type”, containing the breakdown of number of events or fatalities by event or actor type is inserted. The colour and font size of the number of events or fatalities are changed to red and 12 respectively to highlight the total number. These steps and the edited tooltip are seen in Figure 21.\r\nFigure 21: Choropleth Map Part 2The colour of the map is changed to red palette to emphasize the drasticity of the events and fatalities and the title is edited to Number (Figure 22). We will also hide the title of the Choropleth Map, as the title will be created in the dashboard (Figure 23).\r\nFigure 22: Choropleth Map Part 3Figure 23: Choropleth Map Part 4The final interactive Choropleth Map is seen in Figure 24.\r\nFigure 24: Final Choropleth MapProportional Symbol Map\r\nNext, the proportional symbol map is created on a new worksheet, which displays the number of events or fatalities in each location, coloured by event or actor type and with the size determined by the number of events or fatalities. At each point, the country, province, location (town/village) and the number of events or fatalities by event or actor type by month will be shown under tooltip.\r\nThe following variables are placed in the respective locations seen in Figure 25 - Longitude (Columns), Latitude (Rows), Location (Detail), Number (Size), Type (Colour), Country (Tooltip), Province (Tooltip).\r\nFigure 25: Proportional Symbol Map Part 1To allow readers to have an interactive view of the number of events or fatalities by event or actor type by month at each location under tooltip, a new worksheet (By Month) is created. Event Date is placed under Rows and Number under Text. Event Date is changed to month to account for time precision code 3, which is uncertain on the exact date of the event and only has information on the month that it occurred. The field label for Type is hidden, as it will be labelled under tooltip instead. These steps and the breakdown of number of events or fatalities are seen in Figure 26.\r\nFigure 26: Breakdown of Number of Events or Fatalities by Event or Actor Type by Month at Each LocationNext, we return to the Proportional Symbol Map to edit the tooltip. The worksheet “By Month”, containing the breakdown of number of events or fatalities by event or actor type in each month is inserted. The colour and font size of the number of events or fatalities are changed to red and 12 respectively to highlight the total number in the location. These steps and the edited tooltip are seen in Figure 27. Note that the table with the number of events or fatalities in each month may be too long to be seen in the tooltip, but we can filter by event date to find the number in certain month.\r\nFigure 27: Proportional Symbol Map Part 2To allow readers to see overlapping points, the opacity (under color) is set to 60%. The size of the dots is also increased so that the location with larger number of events or fatalities can be easily seen. The steps are shown in Figure 28.\r\nFigure 28: Proportional Symbol Map Part 3To create a border of similar and slightly darker colour tone, Latitude is placed under Rows again and we will click on Dual Axis. Next, we will click on one of the Marks card for AVG(Latitude), change it to Shape and change the opacity (under color) to 80%. The steps are shown in Figure 29.\r\nFigure 29: Proportional Symbol Map Part 4The final interactive Proportional Symbol Map is seen in Figure 30.\r\nFigure 30: Final Proportional Symbol MapInteractive and Synchronised Filters\r\nNext, we will create filters that can be applied across the worksheets. This will allow readers to change the filters on the interactive dashboard and the filters will be applied in the relevant maps and line graph.\r\nWe return to the line graph to insert the filters. We will move the following variables under Filters - Country, Event Type, Sub Event Type, Actor Type, Event Date. For Event Date, we will filter by range of dates, choose the full range of event date and change to month (continuous) (Figure 31). This accounts for time precision code 3, which is uncertain on the exact date of the event and only has information on the month that it occurred. For the rest of the variables, we will choose to use all and the full list of filters is seen in Figure 32.\r\nFigure 31: Filter Part 1Figure 32: Filter Part 2We will then click “Show Filter”. The setting of the Country, Event Type, Sub Event Type and Actor Type filters will be set to “Multiple Values (dropdown)”. The setting of all the filters are also set to “Only Relevant Values”, so that the filters can respond to each other e.g. only the relevant sub events will appear when a particular event is chosen as filter by the reader. These steps are shown in Figure 33.\r\nFigure 33: Filter Part 3The various filters are then changed to apply to all using related data sources, so that the maps, line graph and tooltip will respond to the filters selected by readers. The title of “MONTH(Event Date)” filter is edited to Event Period. The steps are shown in Figure 34.\r\nFigure 34: Filter Part 4The final list of filters is seen in Figure 35.\r\nFigure 35: Final FilterTitle / Lead-in Paragraph\r\nTo create the title or lead-in paragraph to show readers the total number of events and fatalities based on the filters that they apply, a new worksheet (Title) is created.\r\nTo show the start and end date based on the Event Period filter chosen by the readers, the following calculated fields are created. The date format of Start Date and End Date are changed to Month-Year. These steps are seen in Figure 36.\r\nStart Date: MIN([Event Date])\r\nEnd Date: MAX([Event Date])\r\n\r\nFigure 36: Start and End DateWe will then place Number of Events, Fatalities, Start Date and End Date under Text, before editing the title and setting the view to Fit Width, as seen in Figure 37. The total number of events and fatalities are in red and larger font size to highlight these overall numbers to readers.\r\nFigure 37: Final Title / Lead-in ParagraphDashboard\r\nFinally, the dashboard is created. First, the size is changed to Automatic (Figure 38).\r\nFigure 38: Dashboard Part 1The 4 worksheets (Title, Choropleth Map, Proportional Symbol Map, Line Graph) are added to the dashboard. A blank is added for the legends, filters and parameters to be placed. The various side bars (legends, filters, parameters) are changed to Floating to allow easy size adjustment (Figure 39).\r\nFigure 39: Dashboard Part 2The relevant text descriptions are added to direct readers on how to use the filters and parameters in the dashboard and to add the data source. This is done by adding a floating text object. The parameters are changed to single value list to make it quicker for readers to choose what they want to see. Figure 40 shows the steps and the legends, filters, parameters and data source that will be shown on the dashboard.\r\nFigure 40: Dashboard Part 3Floating text objects are also added to label the maps. Figure 41 shows the text that will be added to label the Choropleth Map and Proportional Symbol Map respectively. The labels will change based on the parameters chosen by the readers.\r\nFigure 41: Dashboard Part 4To allow readers to observe the changes when different filters and parameters are applied, the animation is switched on (Figure 42).\r\nFigure 42: Dashboard Part 53.0 Proposed Data Visualisation Using Tableau\r\nFigure 43 shows the dashboard.\r\nFigure 43: DashboardMajor Observations\r\nObservation 1: More than half of political violence, demonstration or select non-violent, politically important events in Southeast Asia from 2010 to 2020 were in Philippines and Myanmar. In 2016 and 2020, a large percentage of events were violence against civilians and protests respectively. These are shown in Figure 44.\r\nOut of 38,244 events, Philippines and Myanmar had 11,092 and 10,482 events respectively, which makes up 56.4% of all events.\r\nIn 2016, 2,678 out of 5,412 (49.5%) events were violence against civilians. In 2020 (data for Jan - Oct 2020), 2,224 out of 5,227 (42.5%) events were protests. Note that we can filter according to event date to have a quick calculation of total number of events for the specified time period.\r\n\r\nFigure 44: Observation 1Observation 2: Majority of fatalities from events in Southeast Asia from 2010 to 2020 occurred in Philippines and Myanmar. From 2010 to 2020, the fatalities were mostly caused by violence against civilians and battles, or by state forces, political militias and rebel groups. These are shown in Figure 45.\r\nOut of 25,707 fatalities, Philippines and Myanmar had 12,905 and 8,913 fatalities respectively, which makes up 84.9% of all fatalities.\r\nFrom the line graphs, we observe that violence against civilians and battles (event type), state forces, political militias and rebel groups (actor type) were the main contributors of fatalities from 2010 to 2020. From observation 1, we noted the large percentage of violence against civilians in 2016, which also caused a large percentage of fatalities i.e. 3,569 out of 4,835 (73.8%) fatalities.\r\n\r\nFigure 45: Observation 2Observation 3: Majority of events and fatalities in Southeast Asia in 2016 occurred in Philippines. The events and fatalities were mostly caused by state forces and political militias. A large number of event and fatalities in Philippines occurred in National Capital Region (Metropolitan Manila). These are shown in Figure 46-47.\r\nOut of 5,412 events and 4,835 fatalities, Philippines had 3,194 events (59.0%) and 4,202 fatalities (86.9%) in 2016.\r\nA large number of events and fatalities in Philippines in 2016 occurred in National Capital Region, Metropolitan Manila, as illustrated by the larger dots. 45.5% (1,454) and 35.1% (1,121) of events were by Political Militias and State Forces respectively. 41.3% (1,734) and 40.1% (1,683) of events were by Political Militias and State Forces respectively. This could be due to the Antidrug Campaign by the Philippines government in 2016.\r\n\r\nFigure 46: Observation 3aFigure 47: Observation 3bObservation 4: A large percentage of protests happening in Southeast Asia in 2020 was in Indonesia. These protests did not result in any fatality. Majority of these protests were peaceful protests. These are shown in Figure 48-49.\r\nFrom observation 1, we noted the large percentage of protests in Southeast Asia in 2020. Out of 2,224 protests in Southeast Asia, 1,050 (47.2%) occurred in Indonesia. 92.7% (973) of the protests in Indonesia were peaceful protests. These makes up 46.9% of all peaceful protests (2,073) in Southeast Asia in 2020. This could be due to the Indonesia Omnibus Law Protests in 2020.\r\n\r\nFigure 48: Observation 4aFigure 49: Observation 4bObservation 5: The number of events and fatalities caused by rebel groups in Thailand decreased from 2010 to 2020. At the same time, the number of events (protests) by protestors increased sharply in 2020. Most of the events by protestors and rebel groups were in Bangkok and Yala/Pattani/Narathiwat respectively. These are shown in Figure 50-52.\r\nFrom 2010 to 2020, the number of events by rebel groups decreased to 71 in 2020, with the highest at 896 in 2012. The number of fatalities by rebel groups also decreased to 65 in 2020, with the highest at 395 in 2013. This could be due to the inactivity of South Thailand Insurgency in recent years. As illustrated by the larger dots, a larger number of such events occurred in Yala, Pattani and Narathiwat, which are in the Southern part of Thailand.\r\nIn 2020, the number of events (protests) by protestors increased sharply to 679. As illustrated by the larger dots, a larger number of such events occurred in Bangkok. This could be due to the 2020-2021 Thai Protests against the government.\r\n\r\nFigure 50: Observation 5aFigure 51: Observation 5bFigure 52: Observation 5c\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-20T15:36:53+08:00",
    "input_file": "dataviz-makeover-3.utf8.md"
  },
  {
    "path": "posts/2021-02-17-dataviz-makeover-2/",
    "title": "ISSS608 Visual Analytics - DataViz Makeover 2",
    "description": "Analysis of Data Visualisation on Public Willingness on Covid-19 Vaccination.",
    "author": [
      {
        "name": "Louis Chong Jia Jun (louis.chong.2019@mitb.smu.edu.sg)",
        "url": "https://www.linkedin.com/in/louis-chong-jia-jun"
      }
    ],
    "date": "2021-02-17",
    "categories": [],
    "contents": "\r\n1.0 Critiques and Improvements of Data Visualisation\r\nA research team is currently conducting a study to understand the willingness of the public on Covid-19 vaccination. The research utilises data from surveys conducted in January 2021. The data is from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub and is hosted at Github. Figure 1 shows two data visualisations created by one of the research scientists of the research.\r\nFigure 1: Original Data VisualisationClarity\r\n[C.1] The data visualisation is titled “Which country is more pro-vacinne” and “% of strongly agreed to vaccination”. However, this does not accurately represent the survey question shown by the data visualisation, which is “If a Covid-19 vaccine were made available to me this week, I would definitely get it”. Furthermore, there are other questions that show whether a country is pro-vaccine e.g. whether they are worried about side effects, whether they will regret not getting the vaccine, etc.\r\n[C.2] The research team uses a general term “pro-vacinne”. Although they went on to show a data visualisation on “% of strongly agreed to vaccination”, it leaves readers guessing whether “pro-vacinne” means strongly agree and/or agree. The title could have been more specific to make it clear to readers what survey response is represented by the data visualisation.\r\n[C.3] There is no lead-in paragraph in the data visualisation to show the key message. Readers may only pick up that a higher percentage of survey respondents in the United Kingdom “strongly agreed to vaccination”, but cannot compare it with the average percentage for all countries surveyed. Furthermore, the data visualisation does not give the total number of survey respondents from the countries. As such, readers cannot find out the exact number of survey respondents that provided certain response to a specific survey question.\r\n[C.4] The demographics of survey respondents are not shown in the data visualisations. As such, readers are not able to compare and understand the sentiments of survey respondents of different demographics e.g. male vs female.\r\n[C.5] The data source is not cited in the data visualisation. This is not ideal, as readers will not be able to find out more about the background and details of the data source.\r\n[C.6] The number of survey respondents from each country is different i.e. different sample sizes. Thus, it’s unfair to compare and inappropriate to display the survey response percentage in a bar chart. Different levels of error or confidence levels should be catered for.\r\nAesthetics\r\n[A.1] The use of the 100% stacked bar chart makes it visually difficult to compare the percentage for each survey response e.g. strongly agree, agree, etc. Instead of using diverging colours to represent the likert scale, it uses 5 different colours, which can be distracting and may not be intuitive to readers that it’s a likert scale. Furthermore, 2, 3 and 4 are not labelled, so readers may not instantly know that they represent “Agree”, “Neutral” and “Disagree”.\r\n[A.2] The 100% stacked bar chart is sorted in alphabetical order, while the other bar chart is sorted in descending order by percentage that strongly agreed. This makes it hard for readers to compare both charts and find out the overall survey response for a specific country that have the highest percentage for “strongly agreed” i.e. United Kingdom.\r\n[A.3] The use of different number of decimal places in both charts is inconsistent. The 100% stacked bar chart uses 0 decimal place, while the other bar chart uses 1 decimal place. This is generally not a good practice for charts that are compared and directly relate to each other.\r\n[A.4] The data visualisation indicates “Vac 1”. However, it’s not clear to readers what the survey question is, unless they refer to the data source, which is not indicated as well.\r\nSketch of Proposed Design\r\nFigure 2 shows the sketch of the proposed data visualisation to replace the one done by the research team. It will address the critiques which were mentioned earlier.\r\nFigure 2: Sketch of Proposed Design[C.1] A filter is shown such that readers can choose the survey question. The survey question will be reflected in the title and all data visualisations or charts will change whenever the reader selects a different survey question.\r\n[C.2] Specific terms are used e.g. strongly agree, agree, neutral, disagree and strongly disagree to make the chosen survey response clear to readers. Readers can also choose the survey response to look at and the title, dot plot and bar chart (breakdown of survey respondents) will change accordingly.\r\n[C.3] The title or lead-in paragraph can be changed by readers according to the chosen Survey Question, Survey Response and filters. It will give readers an overview on the overall survey response percentage and number of survey respondents for the selected survey question. Each data visualisation or chart will also show the number of survey respondents under each point or bar using Tooltip.\r\n[C.4] Readers can use the bar chart (breakdown of survey respondents) to compare and understand the sentiments of survey respondents of different demographics. In addition, they can filter based on each demographic to analyse and compare how the various data visualisations change.\r\n[C.5] The data source will be labelled at the bottom of the data visualisation or dashboard.\r\n[C.6] A parameter is created such that readers can change the confidence interval. This allows a better comparison of survey responses from countries with different sample sizes. The error bars on the dot plot will change when a different confidence interval is chosen.\r\n[A.1] A diverging stacked bar chart is used to represent the survey response (likert scale) instead. Diverging colours are used i.e. dark blue for strongly agree to dark red for strongly disagree. Each survey response is labelled appropriately for clarity to readers.\r\n[A.2] Parameters are created to allow readers to sort both the dot plot and diverging stacked bar chart at the same time. This allows better comparison of the survey responses from each country.\r\n[A.3] All the data visualisations or charts, titles and tooltips are standardised to show percentage in 0 decimal place.\r\n[A.4] The survey questions are properly named for clarity to readers.\r\n2.0 Step-by-Step Description of Data Visualisation Preparation\r\nData Preparation\r\nThe survey data from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub, hosted at Github, is downloaded by running Git Clone on RStudio ($ git clone https://github.com/YouGov-Data/covid-19-tracker).\r\nData files containing responses to the 6 surveys (vac_1, vac2_1, vac2_2, vac2_3, vac2_6, vac_3) and the attributes (gender, age, household_size, household_children, employment_status) are used. This include data from Australia, Canada, Denmark, Finland, France, Germany, Italy, Japan, Netherlands, Norway, Singapore, South Korea, Spain, Sweden and United Kingdom. The relevant columns are extracted via Excel.\r\nEach country’s data file is filtered on Excel and only rows containing responses to the 6 surveys are extracted (Figure 3).\r\nFigure 3: Rows with Survey ResponsesFor Denmark, Finland, Norway and Sweden, the responses to employment status are separated into many columns. IF formula is used on Excel to collate the survey respondent’s employment status in a single column and rename to the respective employment status (Full time employment, Part time employment, Full time student, Retired, Unemployed, Not working, Others) (Figure 4).\r\nFigure 4: Columns with Employment StatusUnder the columns with the survey responses, “1 - Strongly agree” and “5 - Strongly disagree” are renamed to “1” and “5” respectively to allow the diverging stacked bar chart to be built subsequently.\r\nUnder the column with household size, “8” is renamed to “8 or more”.\r\nUnder the column with household children, “5”, “6”, “7” and “8” are renamed to “5 or more” and “Don’t know” to “Prefer not to say”.\r\nThe various countries’ data files are merged in Excel and a column is added to indicate the Country. The final dataset is saved as cleaned.xlsx. A sample of final dataset is seen in Figure 5.\r\nFigure 5: Final DatasetImport into Tableau\r\nThe cleaned.xlsx is imported into Tableau (Figure 6).\r\nFigure 6: Import into Tableau TypeThe data types of Record No, Household Size and Household Children are changed to String (Figure 7).\r\nFigure 7: Change of Data TypeThe vac_1, vac2_1, vac2_2, vac2_3, vac2_6 and vac_3 columns are renamed to the respective survey questions (Figure 8). The columns are clicked and pivoted (Figure 9). This will form two columns, one for Survey Question and another for Survey Response. The two columns are renamed accordingly. Figure 10 shows the data table used for subsequent data visualisations.\r\nFigure 8: Rename Survey QuestionsFigure 9: Pivot ColumnsFigure 10: Data TableMoving on to the Worksheet, the Age, Country, Employment Status, Gender, Household Children, Household Size, Survey Question and Survey Response should be under Dimensions (Figure 11).\r\nFigure 11: DimensionsNext, we right click Survey Response to edit the aliases to the respective Survey Response (Strongly Agree, Agree, Neutral, Disagree, Strongly Disagree) to be clear to readers, as seen in Figure 12.\r\nFigure 12: Aliases for Survey ResponseDiverging Stacked Bar Chart\r\nFirst, we created calculated fields by following the step shown in Figure 13. The following calculated fields are created:\r\nNumber of Records: 1\r\nTotal Count: TOTAL(SUM([Number of Records]))\r\nCount Negative: IF [Survey Response]>3 THEN 1 ELSEIF [Survey Response]=3 THEN 0.5 ELSE 0 END\r\nTotal Count Negative : TOTAL(SUM([Count Negative]))\r\nPercentage: SUM([Number of Records])/[Total Count]\r\nGantt Start: -[Total Count Negative]/[Total Count]\r\nGantt Percent: PREVIOUS_VALUE([Gantt Start])+ZN(LOOKUP([Percentage],-1))\r\n\r\nFigure 13: Create Calculated FieldNext, Survey Response is placed under Detail and Color, Gantt Percent under Columns (Compute Using Survey Response) and Country under Rows. This is shown in Figure 14.\r\nFigure 14: Diverging Stacked Bar Chart Part 1The data visualisation or chart is changed to Gantt Bar (Figure 15).\r\nFigure 15: Diverging Stacked Bar Chart Part 2Percentage is then placed under Size, computed using Survey Response. The colours for Survey Response are edited to diverging colours. This is shown in Figure 16.\r\nFigure 16: Diverging Stacked Bar Chart Part 3As it’s a good practice for negative (strongly disagree and disagree) survey responses to be on the left and positive (strongly agree and agree) survey responses to be on the right, Survey Response is manually sorted, as seen in Figure 17.\r\nFigure 17: Diverging Stacked Bar Chart Part 4We will standardise the axis labels for Percentage to 0 decimal place, with 0.1 tick interval. We will right click to edit axis and format, as shown in Figure 18.\r\nFigure 18: Diverging Stacked Bar Chart Part 5To allow readers to select the survey question, Survey Question is placed under Filters. We will right click to Show Filter and the filter will appear on the right of the worksheet. The filter is changed to Single Value (dropdown) and customised to not show “All” value, as it’s not useful to show the response to all surveys together. This is shown in Figure 19.\r\nFigure 19: Diverging Stacked Bar Chart Part 6Next, we will place Number of Records under Detail to show the number of survey respondents and edit Tooltip, as seen in Figure 20. Percentage is formatted to 0 decimal place (as explained in Figure 18).\r\nFigure 20: Diverging Stacked Bar Chart Part 7The title is also edited, as seen in Figure 21, for clarity to readers. Finally the worksheet is adjusted to Fit Height (Figure 22). The header for x axis (Gantt Percent) and field label for row (Country) are hidden to save space and because they should be easily understood by readers (Figure 23).\r\nFigure 21: Diverging Stacked Bar Chart Part 8Figure 22: Diverging Stacked Bar Chart Part 9Figure 23: Diverging Stacked Bar Chart Part 10Figure 24 shows the diverging stacked bar chart.\r\nFigure 24: Diverging Stacked Bar Chart (Final)Dot Plot with Error Bars\r\nNext, we will create a dot plot with error bars to compare survey responses from different countries of different sample sizes. Normal distribution is assumed. We will right click Create Parameter to create a parameter for Confidence Interval. If we right click to Show Parameter, readers are able to choose the confidence interval to show for the dot plot. This is shown in Figure 25.\r\nFigure 25: Dot Plot Part 1We will also create the following calculated fields (as explained in Figure 13):\r\nZ: IF [Confidence Interval]=“95%” THEN 1.959964 ELSEIF [Confidence Interval]=“99%” THEN 2.575829 END\r\nMargin: [Z] * SQRT(([Percentage] * (1-[Percentage]))/[Total Count])\r\nUpper Limit: [Percentage]+[Margin]\r\nLower Limit: [Percentage]-[Margin]\r\n\r\nCountry is placed under Rows, Survey Response under Detail and Percentage under Columns (Compute Using Survey Response), as seen in Figure 26.\r\nFigure 26: Dot Plot Part 2The following calculated field is also created to ensure that the Survey Response can be filtered without changing the percentage. We will right click this field to convert it to Discrete (Figure 27).\r\nFilter (Survey Response): LOOKUP(ATTR([Survey Responses]), 0)\r\n\r\nFigure 27: Dot Plot Part 3Similar to the diverging stacked bar chart, Survey Question is placed under Filters, as well as Filter (Survey Response). We will right click to Show Filter and the filters will appear on the right of the worksheet. The filters are changed to Single Value (dropdown) and customised to not show “All” value, as it’s not useful to show all options together. The steps were described in Figure 19 earlier. The title of Filter (Survey Response) is edited to Survey Response by Country, as seen in Figure 28.\r\nFigure 28: Dot Plot Part 4Next, Measure Values is placed under Columns and only Lower Limit and Upper Limit are kept (Figure 29). They are formatted to show the Percentage in 0 decimal place (as explained in Figure 18).\r\nFigure 29: Dot Plot Part 5The data visualisation or chart for Percentage is changed to Circle and that of Measure Values is changed to Line. Measure Names is placed under Path under Measure Values. This is shown in Figure 30.\r\nFigure 30: Dot Plot Part 6Dual Axis is created and the axes are synchronised, as seen in Figure 31. The axis titled “Value”, which represents the upper and lower limit percentages, is hidden, as the percentage can be seen in the bottom axis as well. The field label for row (Country) is also hidden to save space and because they should be easily understood by readers (as explained in Figure 23).\r\nFigure 31: Dot Plot Part 7To bring the dots in front of the lines, we right click the Percentage Axis and clicked Move marks to front (Figure 32). As explained earlier in Figure 18, We will also standardise the axis labels for Percentage to 0 decimal place, with 0.1 tick interval.\r\nFigure 32: Dot Plot Part 8Number of Records is placed under Detail under Percentage to show the number of survey respondents. The Tooltip for Percentage and Measure Values are edited, as seen in Figure 33. The Title is edited, as seen in Figure 34, to indicate the Survey Response represented by the dot plot.\r\nFigure 33: Dot Plot Part 9Figure 34: Dot Plot Part 10The Color for Percentage and Measure Values are changed to black and light blue respectively. The worksheet is adjusted to Fit Height (as explained in Figure 22). Figure 35 shows the dot plot with error bars.\r\nFigure 35: Dot Plot with Error Bars (Final)Title / Lead-in Paragraph\r\nNext, we wish to have a title or lead-in paragraph to allow indicate the relevant survey question, overall survey response percentage and number of survey respondents.\r\nA new worksheet is created. Survey Response, Percentage and Total Count are placed under Detail (Figure 36).\r\nFigure 36: Title Part 1Survey Question and Filter (Survey Response) are placed under Filters. We will right click to Show Filter and the filters will appear on the right of the worksheet. The Survey Question and Filter (Survey Response) filters are changed to Single Value (dropdown) and customised to not show “All” value, as it’s not useful to show all options together. The steps were described in Figure 19 earlier. The title of Filter (Survey Response) is edited to Overall Survey Response, as explained in Figure 28.\r\nThe title is edited and Figure 37 shows the interactive title or lead-in paragraph that will be used for the dashboard.\r\nFigure 37: Title Part 2Bar Chart (Breakdown by Demographics)\r\nNext, we will create a bar chart that will break down the survey respondents by demographics e.g. Gender. This will allow readers to compare and understand the sentiments of survey respondents of different demographics.\r\nA parameter, Demographic, is created, as seen in Figure 38 and explained earlier in Figure 25. We will right click Show Parameter and readers will be able to select the demographic to show.\r\nFigure 38: Bar Chart Part 1We will also create the following calculated field (as explained in Figure 13):\r\nDemographic: IF [Parameters].[Demographic]=“Gender” THEN [Gender] ELSEIF [Parameters].[Demographic]=“Household Children” THEN [Household Children] ELSEIF [Parameters].[Demographic]=“Household Size” THEN [Household Size] ELSEIF [Parameters].[Demographic]=“Employment Status” THEN [Employment Status] END\r\n\r\nDemographic is placed under Rows, Percentage under Columns, Number of Records under Detail, Survey Question and Survey Response under Filters.\r\nWe will right click to Show Filter and the filters will appear on the right of the worksheet. The Survey Question and Filter (Survey Response) filters are changed to Single Value (dropdown). Here, only the Survey Question filter is customised to not show “All” value, as it’s not useful to show all options together. The steps were described in Figure 19 earlier. The title of Filter (Survey Response) is edited to Survey Response, as explained in Figure 28.\r\nAs explained earlier in Figure 18, We will standardise the axis labels for Percentage to 0 decimal place, with 0.1 tick interval.\r\nThe title is edited, as seen in Figure 39. The Tooltip is also edited, as seen in Figure 40.\r\nFigure 39: Bar Chart Part 2Figure 40: Bar Chart Part 3The field label for row (Demographic) is hidden to save space and because it’s indicated in the title. The step is explained in Figure 23.\r\nThe Color and Border of the bar chart are changed to make the chart more aesthetically pleasing and clearer. The worksheet is adjusted to Fit Height (as explained in Figure 22). Figure 41 shows the bar chart (breakdown by demographics).\r\nFigure 41: Bar Chart (Final)Interactive and Synchronised Filters\r\nTo ensure the applied filters are synchronised across worksheets so that it can be reflected in all relevant data visualisations on dashboard, we will first place all the relevant filters in one of the worksheets e.g. Dot Plot with Error Bars.\r\nThe following are placed under Filters. The filters are shown and the respective properties are applied. The steps were described in Figure 19 earlier.\r\nGender (Single Value Dropdown)\r\nHousehold Size, Household Children, Employment Status (Multiple Values Dropdown)\r\nAge (Change to Continuous, Range of Values) (Figure 42)\r\n\r\nFigure 42: Filters Part 1To apply the filters across worksheets, we right click each of the relevant filters (Survey Question, Gender, Age, Household Size, Household Children, Employment Status) and apply it to all using related data sources (Figure 43).\r\nFigure 43: Filters Part 2Next, we wish to make the filter interactive i.e. when we click the country in the dot plot with error bars and diverging stacked bar chart, the bar chart (breakdown by demographics) will be filtered accordingly in the dashboard. Figure 44 shows the steps to create this filter, which is under Actions, Add Action, Filter. A filter action will be reflected under Filters, as seen in Figure 45.\r\nFigure 44: Filters Part 3Figure 45: Filters Part 4Dashboard\r\nFinally, the dashboard is created. First, the size is changed to Automatic, as seen in Figure 46.\r\nFigure 46: Dashboard Part 1The 4 worksheets (Title, Dot Plot with Error Bars, Diverging Stacked Bar Chart, Breakdown) are added to the dashboard. Relevant filters are kept in the dashboard and they are changed to Floating (Figure 47) to allow easy size adjustment.\r\nFigure 47: Dashboard Part 2The relevant test descriptions are added to the dashboard to direct readers on how to use the dashboard. The data source is labelled by adding a Text object (Figure 48 and 49).\r\nFigure 48: Dashboard Part 3Figure 49: Dashboard Part 4To allow readers to observe the changes when different filters are applied, the animation is switched on (Figure 50).\r\nFigure 50: Dashboard Part 5To allow the sorting of the dot plot and diverging stacked bar chart to be synchronised and allow better comparison of survey responses from each country, we go back to the dot plot to create two parameters (Sort By, Sort Order), as seen in Figure 51. Steps to create a parameter was earlier explained in Figure 25.\r\nFigure 51: Sorting Part 1We will also create the following calculated field (as explained in Figure 13):\r\nSort Field: CASE [Sort By] WHEN “Percentage” THEN [Percentage] * [Sort Order] WHEN “Alphabetical” THEN MIN(ASCII([Country])) * [Sort Order] END\r\n\r\nSort Field is then applied to sort Country in both the dot plot and diverging stacked bar chart (Figure 52).\r\nFigure 52: Sorting Part 23.0 Proposed Data Visualisation Using Tableau\r\nFigure 53 shows the dashboard.\r\nFigure 53: DashboardMajor Observations\r\nObservation 1: The United Kingdom had the highest percentage of survey respondents that strongly agree to getting Covid-19 vaccine if it’s available this week. Out of the survey respondents aged 55 and above in the United Kingdom, a huge portion strongly agreed (Figure 54 and 55).\r\nAs compared to the average across countries surveyed (42% of 34,026), the United Kingdom had 68% (2,048) of 3,004 survey respondents that strongly agreed to the statement. This could be because the vaccine is made/tested in UK e.g. AstraZeneca. As such, people in the United Kingdom tend to trust the quality check on the vaccines and are more willing to be vaccinated.\r\nOut of the 1,189 survey respondents aged 55 and above in the United Kingdom, 990 (83%) strongly agreed to the statement. This could be due to the higher Covid-19 fatality rate among older people. Thus, they are generally more willing to be vaccinated as compared to younger people to protect themselves.\r\n\r\nFigure 54: Observation 1Figure 55: Observation 1Observation 2: France had the highest percentage of survey respondents that strongly disagree to getting Covid-19 vaccine if it’s available this week. Women are more likely to strongly disagree than men in France (Figure 56 and 57).\r\nAs compared to the average across countries surveyed (18% of 34,026), France had 36% (1,094) of 3,069 survey respondents that strongly disagreed to the statement. According to CNBC, the vaccine skepticism could be due to public distrust in government and far-left and far-right expression of anti-vaccine sentiment.\r\nOut of the 1,094 survey respondents that strongly disagreed, 63% (689) is female. Women are more likely to be hesistant about vaccination than men, possibly due to higher fear of possible side effects.\r\n\r\nFigure 56: Observation 2Figure 57: Observation 2Observation 3: Denmark had the highest percentage of survey respondents that strongly agree that the government health authorities will provide them with an effective Covid-19 vaccine. A higher percentage of survey respondents aged 55 and above in Denmark will strongly agree (Figure 58 and 59).\r\nAs compared to the average across countries surveyed (31% of 34,026), Denmark had 52% (1,034) of 2,001 survey respondents that strongly agreed to the statement. According to Bloomberg, Denmark has one of the most effective Covid Vaccination Program in EU. Throughout the pandemic, there was clear communication with the public over the handling of Covid-19. Thus, people are more willing to place trust in the government health authorities in providing them with an effective Covid-19 vaccine.\r\nThe percentage is higher for survey respondents aged 55 and above in Denmark i.e. 65% (524) of 806 strongly agreed to the statement, as compared to 52% for all ages. This shows possibly a higher level of trust by the older people in Denmark in the government health authorities.\r\n\r\nFigure 58: Observation 3Figure 59: Observation 3\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-23T09:45:17+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-01-19-dataviz-makeover-1/",
    "title": "ISSS608 Visual Analytics - DataViz Makeover 1",
    "description": "Analysis of Data Visualisation in MOM's Report on Labour Force in Singapore.",
    "author": [
      {
        "name": "Louis Chong Jia Jun (louis.chong.2019@mitb.smu.edu.sg)",
        "url": "https://www.linkedin.com/in/louis-chong-jia-jun"
      }
    ],
    "date": "2021-01-19",
    "categories": [],
    "contents": "\r\n1.0 Critiques and Improvements of Data Visualisation\r\nThe Report on Labour Force in Singapore (https://stats.mom.gov.sg/Pages/Labour-Force-In-Singapore-2019.aspx) is a key annual report on Singapore’s labour market. Below is a critique of MOM’s data visualisation on the resident labour force and how it can be improved. The data is available at https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx, Table 5, Resident Labour Force Participation Rate by Age and Sex, 2009 - 2019 (June), and Table 7, Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009 - 2019 (June).\r\nFigure 1: MOM’s Data VisualisationClarity\r\nBy looking at the two lines (blue and grey) in the data visualisation, we can generally tell that the share of resident labour force aged 55 & over was higher in 2019 (blue line) than 2009 (grey line) and lower for residents aged 25 to 54, which were mentioned in the lead-in paragraph. However, a line chart should not be used, as data was aggregated at each age range and it would otherwise make readers imply that the share of resident labour force can be interpolated and calculated at each age.\r\nA scatter plot can be used instead, with each point showing the share of resident labour force at each age range.\r\n\r\nThe lead-in paragraph compared the 2009 and 2019 share of resident labour force aged 25 to 54 and 55 & over. However, it is hard for readers to tabulate and compare the total share of resident labour force for these age ranges, as the data values were mostly given in 5-year age range. Furthermore, having too many age ranges make comparison tedious as well as redundant when the data values are similar.\r\nFewer age ranges can be used (15 to 24, 25 to 54, 55 to 64 and 65 & over) for the scatter plot to improve readability and aid comparison. The share of resident labour force and labour force participation rate for these age ranges will be calculated using the available data.\r\n\r\nThe reference lines clearly showed that the median age of residents in the labour force was higher in 2019 than 2009. However, it gives a wrong impression that the share of resident labour force can be interpolated and calculated at each age.\r\nThe reference lines can be removed from the data visualisation to prevent confusion.\r\n\r\nThe lead-in paragraph talks about the labour force participation rate. However, we cannot tell from the data visualisation how the labour force participation rate in 2019 differs from 2009.\r\nThe labour force participation rate can be used as the size for each point on the scatter plot i.e. bigger point implies higher labour force participation rate at the age range.\r\n\r\nThe title of the data visualisation should not be “resident labour force by age”. It gives a false impression that we can interpolate and find the share of resident labour force at each age.\r\nThe title can be changed to “How did the Resident Labour Force (%) at each Age Range change from 2009 to 2019?” to correctly represent the data given and make it appealing to readers.\r\n\r\nAesthetics\r\nThe use of two contrasting colours (blue and grey) for the lines and table rows clearly showed the data values belonging to the two years.\r\nFor the improved data visualisation, we can similarly use two contrasting colours for the scatter plot and data values.\r\n\r\nThe multiple labelling of “June 2009” and “June 2019” is not necessary, given the use of colours to differentiate the years.\r\nThe multiple labels can be removed and a legend can be created to show the colours (for the scatter plot and data values) that represent each year.\r\n\r\nThe tick marks on the x-axis are wrongly placed, inappropriate and confusing, as age range should be a categorical rather than a continuous variable. It gives a wrong impression that we can interpolate and find the share of resident labour force at each age.\r\nThe tick marks on the x-axis are not necessary and can be removed.\r\n\r\nThe data source is properly and clearly labelled at the bottom of the data visualisation.\r\nSimilarly, we can label the data source clearly in the improved data visualisation.\r\n\r\nSketch of Proposed Design\r\nFigure 2: Sketch of DesignThe first key message to convey is the change in the share of resident labour force from 2009 to 2019. Each point in the scatter plot represents the share of resident labour force at each age range and they are properly labelled with the data values. Readers will not be confused that the values can be interpolated at each age.\r\nThe next level of details to show readers is the labour force participation rate in 2009 and 2019. It can be easily compared by either looking at the size of the points or referring to the values in the table.\r\nAll points and data values are clearly shown and coloured according to the year.\r\n2.0 Step-by-Step Description of Data Visualisation Preparation\r\nData Preparation\r\nThe available data values from 2009 to 2019 for Resident Labour Force (RLF) and Labour Force Participation Rate (LFPR) are analysed. There is no notable change or spike in values between 2009 and 2019. Hence, the proposed data visualisation will focus on 2009 and 2019 values.\r\nThe 2009 and 2019 values for four age ranges (15 to 24, 25 to 54, 55 to 64, 65 & over) are collated in Excel. Additional calculations are required to convert LFPR from thousands to percentage (%).\r\nThe data values are then imported onto Tableau. The columns are renamed to appropriately represent the data values i.e. Age Range, RLF2009, RLF2019, LFPR2009, LFPR2019.\r\nFigure 3: Collated Data Values on ExcelFigure 4: Imported Data ValuesScatter Plot\r\n“Age Range” is placed under Columns and “RLF2009” and “RLF2019” are placed under Rows.\r\nThe bar charts are converted into scatter plot by clicking on dual axis. The axes are also synchronised.\r\nFigure 5: Scatter Plot Part 1To allow comparison of the labour force participation rate, “LFPR2009” and “LFPR2019” are placed under Size. The size of the points will reflect the labour force participation rate i.e. larger dot will indicate higher labour force participation rate.\r\nAs there are overlaps of the points, the opacity is set at 50% to allow easier comparison between the data values in 2009 and 2019. To further facilitate comparison, the size of the points is increased and contrasting colours (grey and blue) are used for 2009 and 2019 points after placing “Measure Names” under Colour.\r\nFigure 6: Scatter Plot Part 2“RLF2009” and “RLF2019” are placed under Label to show the RLF data values for 2009 and 2019. The labels are properly aligned and coloured according to the year.\r\nA legend is created using Annotation to show the colours that represent each year and therefore, multiple labelling is not required. The headers and field label for columns are also hidden to simplify the chart for readers and the dimensions of the chart are adjusted.\r\nFigure 7: Scatter Plot (Final)Data Table on Labour Force Participation Rate\r\n“Age Range” is placed under Columns and “LFPR2009” and “LFPR2019” are placed under Rows. Text Table under Show Me is clicked to generate the data table for LFPR. The rows and columns are swapped.\r\n“Measure Names” is placed under Colour and the font colours are changed to match the year.\r\nThe headers and field label for columns are hidden to simplify the chart for readers and reduce redundancy.\r\nFigure 8: LFPR DataDashboard\r\nA dashboard is created. The title, lead-in paragraph and source are added as text. The scatter plot and LFPR data table are added. Blanks are added to adjust the dashboard dimensions.\r\n3.0 Proposed Data Visualisation Using Tableau\r\nFigure 9: Tableau DesignMajor Observations\r\nA higher percentage of older residents was in the labour force in 2019. The share of resident labour force aged 55 & over rose from 15.7% in 2009 to 24.6% in 2019.\r\nThis was contributed by the higher labour force participation rate for residents aged 55 to 64 (69.9% in 2019 vs 60.6% in 2009) and residents aged 65 & over (28.7% in 2019 vs 17.2% in 2009).\r\nAt the same time, the share of resident labour force aged 25 to 54 fell from 75.4% in 2019 to 67.4% in 2019. This was despite having a higher labour force participation rate in 2019 (88.3%) than 2009 (84.5%).\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-26T23:49:57+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  },
  {
    "path": "posts/2021-01-04-my-first-post/",
    "title": "My first post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Louis Chong Jia Jun",
        "url": "https://example.com/louischong"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coefficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coefficients of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-04-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-05T22:13:45+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to IDEA",
    "description": "Welcome to our new blog, IDEA. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Louis Chong Jia Jun",
        "url": "https://example.com/louischong"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-04T20:59:57+08:00",
    "input_file": {}
  }
]
